app/controllers/tasks_controller.rb

    def create
        @task = Task.new(task_params)

        if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at", "content") VALUES (?, ?, ?)  [["created_at", "2023-12-13 17:28:14.899579"], ["updated_at", "2023-12-13 17:28:14.899579"], ["content", "go to the gym"]]

    def destroy
        @task = Task.find_by(id: params[:id])

        if @task and @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]

    def mark_complete
        @task = Task.find_by(id: params[:id])

        if @task and @task.update(completed: true)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = ?, "completed" = ? WHERE "tasks"."id" = ?  [["updated_at", "2023-12-13 17:44:07.726688"], ["completed", 1], ["id", 3]]

    def mark_active
        @task = Task.find_by(id: params[:id])
        if @task and @task.update(completed: false)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = ?, "completed" = ? WHERE "tasks"."id" = ?  [["updated_at", "2023-12-13 17:44:31.508504"], ["completed", 0], ["id", 6]]